---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.DefaultProjectTemplate
source: html/ace111c3-aa20-71d0-ab52-14d1288ef182.htm
---
# Autodesk.Revit.ApplicationServices.Application.DefaultProjectTemplate Property

Full path to the default template file for new project documents.

## Syntax (C#)
```csharp
public string DefaultProjectTemplate { get; }
```